# LAB 04 - Data preprocessing

## 01 열 기준 병합

### #01. 준비작업

In [2]:
from hossam import load_data
from pandas import DataFrame
from pandas import merge

In [3]:
# 샘플 데이터 가져오기 - 고객 데이터와 매출 샘플 에이터
고객 = load_data('customer_no_name')
고객

[data] https://data.hossam.kr/data/lab04/customer-no-name.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 고객 이름에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [4]:
매출 = load_data('customer_no_pay')
매출

[data] https://data.hossam.kr/data/lab04/customer-no-pay.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 매출액에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

###  #02.열 기준 병합 (1) 일치하는 데이터끼리 병합
- merge를 활용한 inner join
- 서로 일치하는 데이터끼리만 병합되고 ,일치 하지 않으면 버려진다
- key 값이 여러개 일치하면 경우의 수 만큼 행이 생성된다

In [5]:
merge(고객,매출)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

###  #02.열 기준 병합 (2) 왼쪽 데이터 프레임을 기준으로 병합 
- SQL 의 LEFT OUTER JOIN

In [6]:
merge(고객,매출,how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

###  #02.열 기준 병합 (3) 오른쪽 데이터 프레임을 기준으로 병합 
- SQL 의 RIGHT OUTER JOIN

In [7]:
merge(고객,매출,how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

### #03. 병합 기준 열 지정하기 (1) on 을 활용한 기본 열 지정 후 병합

In [8]:
#샘플 데이터 가져오기
cd1=load_data('customer_data1')
cd1

[data] https://data.hossam.kr/data/lab04/customer_data1.xlsx
[desc] 데이터 병합용 실습 데이터 (1) (인덱스/메타데이터 없음)
[!] Cannot read metadata

  고객명         날짜     데이터
0  민수 2018-01-01   20000
1  수영 2018-01-01  100000

In [9]:
cd2=load_data('customer_data2')
cd2

[data] https://data.hossam.kr/data/lab04/customer_data2.xlsx
[desc] 데이터 병합용 실습 데이터 (2) (인덱스/메타데이터 없음)
[!] Cannot read metadata

  고객명  데이터
0  민수  21세
1  수영  20세

In [11]:
#cd1 과 cd2 를 병합하게 되면, 이름이 같은 컬럼이 고객명과 데이터 2개 이므로 and 조건으로 조인을 실행하게 된다. 하지만 데이터 컬럼의 경우, cd1 은 int, cd2 는 str 이다 보니 데이터 타입이 달라 에러가 발생한다.

#이처럼 특정 컬럼에 대해서만 조인을 실행하려 할 떄는 병합하려는 열 기준을 지정해줘야한다 > on 사용

tmp = merge(cd1,cd2,on='고객명')
tmp

  고객명         날짜   데이터_x 데이터_y
0  민수 2018-01-01   20000   21세
1  수영 2018-01-01  100000   20세

### #03. 병합 기준 열 지정하기 (2) 두 데이터 프레임의 모든 컬럼의 이름이 다른 경우
- df_left 의 이름 컬럼과 df_right 의 성함 컬럼을 기준으로 병합하고 싶을 떈, left_on ,right_on 옵션

In [12]:
df_left = DataFrame({'이름':['영희','철수'],'국어':[87,91]})
df_left

   이름  국어
0  영희  87
1  철수  91

In [13]:
df_right = DataFrame({'성함':['영희','철수'],'영어':[90,82]})
df_right

   성함  영어
0  영희  90
1  철수  82

In [16]:
r3 = merge(df_left,df_right,left_on=['이름'],right_on=['성함'])
r3

   이름  국어  성함  영어
0  영희  87  영희  90
1  철수  91  철수  82

### #04. 인덱스를 활용한 병합
- 컬럼이 아닌 인덱스를 통해서도 조인을 진행할 수 있다
- left_index=True 옵션으로 인덱스를 키값처럼 사용할 것인지 지정할 수 있다
- 디폴트는 inner join 이나 how 옵션으로 다른 조인도 가능

In [18]:
df_left = DataFrame ({'수학':[90,82]},index =['민철','봉구'])
df_left

    수학
민철  90
봉구  82

In [19]:
df_right = DataFrame ({'국어':[90,82]},index =['민철','철수'])
df_right

    국어
민철  90
철수  82

In [20]:
merge(df_left,df_right,left_index=True,right_index=True)

    수학  국어
민철  90  90

In [21]:
merge(df_left,df_right,left_index=True,right_index=True,how='left')

    수학    국어
민철  90  90.0
봉구  82   NaN

In [22]:
merge(df_left,df_right,left_index=True,right_index=True,how='right')

      수학  국어
민철  90.0  90
철수   NaN  82

In [23]:
merge(df_left,df_right,left_index=True,right_index=True,how='outer')

      수학    국어
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

### #05. 인덱스와 컬럼을 각각 기준으로 하기
- 인덱스와 컬럼이름을 하나씩 사용하여 조인도 가능함

In [38]:
df_left = DataFrame({'수학':[90,82]},index=['민철','봉구'])
df_left

    수학
민철  90
봉구  82

In [37]:
df_right = DataFrame({'성명':['민철','철수'],'영어':[90,82]})
df_right

   성명  영어
0  민철  90
1  철수  82

In [39]:
#왼쪽은 인덱스, 오른쪽은 컬럼을 기준으로 inner join
merge(df_left,df_right,left_index=True,right_on=['성명'])

   수학  성명  영어
0  90  민철  90

In [40]:
#왼쪽은 인덱스, 오른쪽은 컬럼을 기준으로 left outer join
merge(df_left,df_right,left_index=True,right_on=['성명'],how='left')

     수학  성명    영어
0.0  90  민철  90.0
NaN  82  봉구   NaN

In [41]:
#왼쪽은 인덱스, 오른쪽은 컬럼을 기준으로 right outer join
merge(df_left,df_right,left_index=True,right_on=['성명'],how='right')

     수학  성명  영어
0  90.0  민철  90
1   NaN  철수  82

In [43]:
#왼쪽은 인덱스, 오른쪽은 컬럼을 기준으로 full outer join
tmp = merge(df_left,df_right,left_index=True,right_on=['성명'],how='outer')
tmp

       수학  성명    영어
0.0  90.0  민철  90.0
NaN  82.0  봉구   NaN
1.0   NaN  철수  82.0

In [44]:
#병합 후에는 인덱스를 정리해야한다
tmp2 = tmp.set_index('성명')
tmp2

      수학    영어
성명
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0